//: Playground - noun: a place where people can play

import UIKit

//절대값 프린트.






//홀짝 프린트 함수(홀수 인지 짝수인지 확인)





//영화표값 계산하기.
//기본가격 :        9000원
//10시까지 조조 :   -10%
//청소년 :         -10%
//argument : 영화시간(24시간제), 성인인원, 청소년인원.





//지폐별 갯수
//금액을 입력받고 100원, 500원, 1,000원, 5,000원, 10,000원, 50,000원권으로 각각 몇 장씩 나눠지는지 프린트.






//윤년구하기
//서력 기원 연수가 4로 나누어떨어지는 해는 윤년으로 한다.(2004년, 2008년, 2012년, 2016년, 2020년, 2024년 …)
//이 중에서 100으로 나누어떨어지는 해는 평년으로 한다.(1900년, 2100년, 2200년, 2300년, 2500년 …)
//그중에 400으로 나누어떨어지는 해는 윤년으로 둔다.(1600년, 2000년, 2400년 …)

//연도를 입력받고 윤년인지 평년인지 프린트.

